{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.0", "userDefinedMetadata": {"signature": {"outputs": {"predictions": {"name": "predictions"}}}}, "modelTopology": {"node": [{"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_1/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "51"}, {"size": "51"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_1/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "25"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "FastPSPModule/ResizeBilinear/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_2/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "25"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_3/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "25"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_4/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "25"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_5/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "25"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_1/bottleneck_v1/conv2/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_6/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "25"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_1/bottleneck_v1/conv2/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_1/bottleneck_v1/conv2/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_2/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "51"}, {"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_1/bottleneck_v1/conv2/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_3/bottleneck_v1/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "51"}, {"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_1/bottleneck_v1/conv2/SpaceToBatchND/block_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_1/bottleneck_v1/conv2/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "CascadeFeatureFusion/Interp/ResizeBilinear/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "CascadeFeatureFusion/DilatedConv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "51"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_3/bottleneck_v1/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Interp/ResizeBilinear/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "CascadeFeatureFusion_1/Interp/ResizeBilinear/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "CascadeFeatureFusion/DilatedConv/SpaceToBatchND/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}}, {"name": "CascadeFeatureFusion_1/DilatedConv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "25"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "CascadeFeatureFusion/DilatedConv/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "CascadeFeatureFusion/DilatedConv/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"dtype": {"type": "DT_UINT8"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "300"}, {"size": "300"}, {"size": "3"}]}}}}, {"name": "Preprocessor/sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "CascadeFeatureFusion/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "CascadeFeatureFusion/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Interp_1/ResizeBilinear/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Predictions/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Predictions/Conv/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Predictions/Interp/ResizeBilinear/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ArgMax/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "6"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "6"}, {"size": "6"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "CascadeFeatureFusion_1/DilatedConv/BatchNorm/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "6"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "6"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "CascadeFeatureFusion_1/DilatedConv/BatchNorm/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "6"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "12"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv_3/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}}}, {"name": "CascadeFeatureFusion/DilatedConv/BatchNorm/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "6"}, {"size": "25"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "CascadeFeatureFusion_1/Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "CascadeFeatureFusion_1/Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "6"}]}}}}}, {"name": "CascadeFeatureFusion/DilatedConv/BatchNorm/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "6"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "6"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "6"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "6"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}}}, {"name": "CascadeFeatureFusion/Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "CascadeFeatureFusion/Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "12"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "12"}, {"size": "51"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "51"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "12"}, {"size": "12"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "12"}, {"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "51"}, {"size": "12"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "12"}, {"size": "12"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_6/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "12"}, {"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_3/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "51"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_4/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_6/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_4/bottleneck_v1/conv2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "12"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_4/bottleneck_v1/conv2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_4/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "12"}, {"size": "51"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block2/unit_4/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_1/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "51"}, {"size": "25"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_5/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_1/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_1/bottleneck_v1/shortcut/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "51"}, {"size": "102"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_1/bottleneck_v1/shortcut/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "102"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_1/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "102"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_5/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_1/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "102"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_2/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "102"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_2/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_2/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "102"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_2/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "102"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_3/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "102"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_4/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_3/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_3/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "102"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_3/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "102"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_4/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "102"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_4/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_4/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_4/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "102"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_4/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "102"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_5/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "102"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_5/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_5/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "102"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_5/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "102"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_6/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "102"}, {"size": "25"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_6/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_3/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_6/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "25"}, {"size": "102"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_6/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "102"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_1/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "102"}, {"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_1/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_1/bottleneck_v1/shortcut/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "102"}, {"size": "204"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_1/bottleneck_v1/shortcut/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "204"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_1/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "51"}, {"size": "204"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_1/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "204"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_2/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "204"}, {"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_2/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_2/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_2/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "51"}, {"size": "204"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_2/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "204"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_3/bottleneck_v1/conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "204"}, {"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_3/bottleneck_v1/conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_3/bottleneck_v1/conv3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "51"}, {"size": "204"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block4/unit_3/bottleneck_v1/conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "204"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "FastPSPModule/Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "204"}, {"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "FastPSPModule/Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block3/unit_1/bottleneck_v1/conv2/BatchNorm/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ToFloat", "op": "Cast", "input": ["inputs"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_UINT8"}}}, {"name": "Preprocessor/sub", "op": "Sub", "input": ["ToFloat", "Preprocessor/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Interp/ResizeBilinear", "op": "ResizeBilinear", "input": ["Preprocessor/sub", "Interp/ResizeBilinear/size"], "attr": {"align_corners": {"b": true}, "half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv/Relu6", "op": "_FusedConv2D", "input": ["Preprocessor/sub", "Conv/Conv2D_weights", "Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/Pad", "op": "Pad", "input": ["Interp/ResizeBilinear", "SharedFeatureExtractor/resnet_v1_50/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv_1/Relu6", "op": "_FusedConv2D", "input": ["Conv/Relu6", "Conv_1/Conv2D_weights", "Conv_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/conv1/Relu", "op": "_FusedConv2D", "input": ["SharedFeatureExtractor/resnet_v1_50/Pad", "SharedFeatureExtractor/resnet_v1_50/conv1/Conv2D_weights", "SharedFeatureExtractor/resnet_v1_50/conv1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Conv_2/Relu6", "op": "_FusedConv2D", "input": ["Conv_1/Relu6", "Conv_2/Conv2D_weights", "Conv_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/pool1/MaxPool", "op": "MaxPool", "input": ["SharedFeatureExtractor/resnet_v1_50/conv1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Conv_3/Relu6", "op": "_FusedConv2D", "input": ["Conv_2/Relu6", "Conv_3/Conv2D_weights", "Conv_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Relu", "op": "_FusedConv2D", "input": ["SharedFeatureExtractor/resnet_v1_50/pool1/MaxPool", "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D_weights", "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm", "op": "_FusedConv2D", "input": ["SharedFeatureExtractor/resnet_v1_50/pool1/MaxPool", "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D_weights", "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "CascadeFeatureFusion_1/Conv/BatchNorm/FusedBatchNorm", "op": "_FusedConv2D", "input": ["Conv_3/Relu6", "CascadeFeatureFusion_1/Conv/Conv2D_weights", "CascadeFeatureFusion_1/Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Relu", "op": "_FusedConv2D", "input": ["SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Relu", "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D_weights", "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "CascadeFeatureFusion_1/Shape", "op": "Shape", "input": ["CascadeFeatureFusion_1/Conv/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm", "op": "_FusedConv2D", "input": ["SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Relu", "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D_weights", "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "CascadeFeatureFusion_1/strided_slice", "op": "StridedSlice", "input": ["CascadeFeatureFusion_1/Shape", "CascadeFeatureFusion/strided_slice/stack", "CascadeFeatureFusion/strided_slice/stack_1", "CascadeFeatureFusion/strided_slice/stack"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/add", "op": "Add", "input": ["SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/BatchNorm/FusedBatchNorm", "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/Relu", "op": "Relu", "input": ["SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Relu", "op": "_FusedConv2D", "input": ["SharedFeatureExtractor/resnet_v1_50/block1/unit_1/bottleneck_v1/Relu", "SharedFeatureExtractor/resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D_weights", "SharedFeatureExtractor/resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "SharedFeatureExtractor/resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Relu", "op": "_FusedConv2D", "input": ["SharedFeatureExtractor/resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Relu", "SharedFeatureExtractor/resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D_weights", 